#+PROPERTY: Effort_ALL 0 0:10 0:30 1:00 2:00 3:00 4:00 5:00 6:00 7:00
#+COLUMNS: %40ITEM(Task) %17Effort(Estimated Effort){:} %CLOCKSUM

* Doing
** TODO PRPs algorithms
CLOCK: [2015-04-04 Sat 23:38]--[2015-04-05 Sun 00:06] =>  0:28
CLOCK: [2015-04-03 Fri 22:20]--[2015-04-03 Fri 22:41] =>  0:21
:PROPERTIES:
:Effort:   2:00
:END:

1. iterate the edges
2. get the src and dst vertices
3. create new vertices
4. add two edges and remove the old one

- add PRPs at once, or it is hard to find whether it is PRP or not

- [ ] adding PRPs or PRFs? (first all use PRP)
- [X] test Z3 so

* Todo
** improvement
- [ ] add PRFs, iterate all the edges
** base graphs
- functions -> generate vertices, and edges
- connect verices
- pointer -> use specific index, B1, B1, B2 etc? how about level?
  (structures)
- level connection concept -> all high level.
  

- [X] level combination
- [X] #src -> all combinations
- [ ] structure
- [ ] B1
- [ ] B2
- [ ] B3
** decryptable
- [ ] pointer to the inputs outputs?
- [ ] same block
- [ ] with previous block
** duplication
- [ ] hashtable

** base graphs
- constraints
  n srcs -> n-1 XORs -> n-1 B_i
- distinct outputs
  B1: 2 -> 1
  B2: 2 -> 2
  B3: 3 -> 2

** #src = 3
- [B1] [B1]
- [B1] [B2] ?
- [B2] [B1]
- [B2] [B2]
- [B2] [B3]
- [B3] [B1]
- [B3] [B2]
** #src = 4
** algorithm
|                  | B1   | B2   | B3   |
|------------------+------+------+------|
| distinct outputs | 2->1 | 2->2 | 3->2 |
| change           | -1   | 0    | -1   |
- #src = n, #B = n - 1, #level =< #B =< n - 1

** algorithm
** base graph
- optional, hashtable
- input #src
- each level
- array: instructions, edge list, 
- label: input, output
  
* Done
** DONE reconfigure graph
CLOSED: [2015-04-05 Sun 12:51]
CLOCK: [2015-04-05 Sun 12:32]--[2015-04-05 Sun 12:50] =>  0:18
CLOCK: [2015-04-05 Sun 01:50]--[2015-04-05 Sun 02:11] =>  0:21
:PROPERTIES:
:Effort:   1:00
:END:
- [X] add PRF into the block
- [X] vertices list or array?
- [X] edge list ?
** DONE valid -> secure
- [X] SMT solver
** DONE assign families
- [X] topological sort

** DONE topological order to list
CLOSED: [2015-04-02 Thu 22:52]
CLOCK: [2015-04-02 Thu 22:28]--[2015-04-02 Thu 22:52] =>  0:24
- save once?
** DONE SMT interface
CLOSED: [2015-04-03 Fri 20:15]
- Genrand -> exception?















